#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/drifterapps/gh-actions-drifterapps-app/runs/run-twrau7h4JWyZuT7i

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_droplet.k3s_server will be created
  + resource "digitalocean_droplet" "k3s_server" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = true
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "k3s-prd-cluster"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "tor1"
      + resize_disk          = true
      + size                 = "s-1vcpu-2gb"
      + ssh_keys             = (known after apply)
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_ssh_key.quickstart_ssh_key will be created
  + resource "digitalocean_ssh_key" "quickstart_ssh_key" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "k3s-prd-droplet-ssh-key"
      + public_key  = (known after apply)
    }

  # local_file.ssh_public_key_openssh will be created
  + resource "local_file" "ssh_public_key_openssh" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./id_rsa.pub"
      + id                   = (known after apply)
    }

  # local_sensitive_file.ssh_private_key_pem will be created
  + resource "local_sensitive_file" "ssh_private_key_pem" {
      + content              = (sensitive value)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "./id_rsa"
      + id                   = (known after apply)
    }

  # tls_private_key.global_key will be created
  + resource "tls_private_key" "global_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.domains.digitalocean_record.A-records["adminer"] will be created
  + resource "digitalocean_record" "A-records" {
      + domain = "drifterapps.app"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "adminer"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.domains.digitalocean_record.A-records["holefeeder"] will be created
  + resource "digitalocean_record" "A-records" {
      + domain = "drifterapps.app"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "holefeeder"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.domains.digitalocean_record.A-records["k3s-prd"] will be created
  + resource "digitalocean_record" "A-records" {
      + domain = "drifterapps.app"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "k3s-prd"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.domains.digitalocean_record.A-records["portainer"] will be created
  + resource "digitalocean_record" "A-records" {
      + domain = "drifterapps.app"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "portainer"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.domains.digitalocean_record.A-records["seq"] will be created
  + resource "digitalocean_record" "A-records" {
      + domain = "drifterapps.app"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "seq"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.domains.digitalocean_record.AAAA-records["adminer"] will be created
  + resource "digitalocean_record" "AAAA-records" {
      + domain = "drifterapps.app"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "adminer"
      + ttl    = (known after apply)
      + type   = "AAAA"
      + value  = (known after apply)
    }

  # module.domains.digitalocean_record.AAAA-records["holefeeder"] will be created
  + resource "digitalocean_record" "AAAA-records" {
      + domain = "drifterapps.app"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "holefeeder"
      + ttl    = (known after apply)
      + type   = "AAAA"
      + value  = (known after apply)
    }

  # module.domains.digitalocean_record.AAAA-records["k3s-prd"] will be created
  + resource "digitalocean_record" "AAAA-records" {
      + domain = "drifterapps.app"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "k3s-prd"
      + ttl    = (known after apply)
      + type   = "AAAA"
      + value  = (known after apply)
    }

  # module.domains.digitalocean_record.AAAA-records["portainer"] will be created
  + resource "digitalocean_record" "AAAA-records" {
      + domain = "drifterapps.app"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "portainer"
      + ttl    = (known after apply)
      + type   = "AAAA"
      + value  = (known after apply)
    }

  # module.domains.digitalocean_record.AAAA-records["seq"] will be created
  + resource "digitalocean_record" "AAAA-records" {
      + domain = "drifterapps.app"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "seq"
      + ttl    = (known after apply)
      + type   = "AAAA"
      + value  = (known after apply)
    }

  # module.firewall.digitalocean_firewall.k3s_firewall will be created
  + resource "digitalocean_firewall" "k3s_firewall" {
      + created_at      = (known after apply)
      + droplet_ids     = (known after apply)
      + id              = (known after apply)
      + name            = "k3s-prd-firewall"
      + pending_changes = (known after apply)
      + status          = (known after apply)

      + inbound_rule {
          + protocol                  = "icmp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "22"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "443"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "6443"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "80"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + protocol                       = "icmp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "udp"
        }
    }

  # module.k3s_common.helm_release.cert_manager will be created
  + resource "helm_release" "cert_manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.11.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
    }

  # module.k3s_common.helm_release.portainer will be created
  + resource "helm_release" "portainer" {
      + atomic                     = false
      + chart                      = "portainer"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "portainer"
      + namespace                  = "portainer"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://portainer.github.io/k8s/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.0.38"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "service.type"
          + value = "LoadBalancer"
        }
    }

  # module.k3s_common.local_file.kube_config_server_yaml will be created
  + resource "local_file" "kube_config_server_yaml" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./kube_config_server.yaml"
      + id                   = (known after apply)
    }

  # module.k3s_common.null_resource.deploy_cert_manager_config will be created
  + resource "null_resource" "deploy_cert_manager_config" {
      + id       = (known after apply)
      + triggers = {
          + "policy_sha1" = "bd14c5fce1a785e28c034033b46213086ef41635"
        }
    }

  # module.k3s_common.null_resource.deploy_portainer_config will be created
  + resource "null_resource" "deploy_portainer_config" {
      + id       = (known after apply)
      + triggers = {
          + "policy_sha1" = "1906eec0b925bc751871e77f9fa56284a7319b10"
        }
    }

  # module.k3s_common.null_resource.deploy_traefik_config will be created
  + resource "null_resource" "deploy_traefik_config" {
      + id       = (known after apply)
      + triggers = {
          + "policy_sha1" = "2e0536d470e577767ce5ba9f757ebe2cf753a936"
        }
    }

  # module.k3s_common.ssh_resource.install_k3s will be created
  + resource "ssh_resource" "install_k3s" {
      + agent                       = false
      + bastion_port                = "22"
      + commands                    = (known after apply)
      + commands_after_file_changes = true
      + host                        = (known after apply)
      + id                          = (known after apply)
      + port                        = "22"
      + private_key                 = (sensitive value)
      + result                      = (known after apply)
      + retry_delay                 = "10s"
      + timeout                     = "5m"
      + user                        = "root"
      + when                        = "create"
    }

  # module.k3s_common.ssh_resource.k3s_installation_complete will be created
  + resource "ssh_resource" "k3s_installation_complete" {
      + agent                       = false
      + bastion_port                = "22"
      + commands                    = [
          + "until systemctl status k3s | grep 'Active: active (running)'; do echo 'Waiting for k3s service to start...'; sleep 2; done",
        ]
      + commands_after_file_changes = true
      + host                        = (known after apply)
      + id                          = (known after apply)
      + port                        = "22"
      + private_key                 = (sensitive value)
      + result                      = (known after apply)
      + retry_delay                 = "10s"
      + timeout                     = "5m"
      + user                        = "root"
      + when                        = "create"
    }

  # module.k3s_common.ssh_resource.retrieve_config will be created
  + resource "ssh_resource" "retrieve_config" {
      + agent                       = false
      + bastion_port                = "22"
      + commands                    = (known after apply)
      + commands_after_file_changes = true
      + host                        = (known after apply)
      + id                          = (known after apply)
      + port                        = "22"
      + private_key                 = (sensitive value)
      + result                      = (known after apply)
      + retry_delay                 = "10s"
      + timeout                     = "5m"
      + user                        = "root"
      + when                        = "create"
    }

Plan: 25 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @patmoreau, Action: `pull_request`*